{

  "title": "Lebenslauf",
  "grade": "Note",
  "header": {
    "download": "Download"
  },
  "resume": {
    "header": {
      "name": "Annika Fuhge",
      "title": "Frontend Entwicklerin",
      "quote": "Ich liebe es kreativ zu sein, mich zu organisieren und im Team zu arbeiten. Meine Weiterbildung ist mir wichtig, sodass ich begeistert und motiviert an neue Dinge herangehe."
    },
    "content": {
      "work-experience": {
        "headline": "Berufserfahrung",
        "ecostag": {
          "company": "ecostag GmbH",
          "title": "Frontend Entwicklerin",
          "description": "Weiterentwicklung einer Ticketingplattform mit besonderem Fokus auf den Promoterbereich. Enge Zusammenarbeit mit Future Demand bei der Integration ihrer KI-basierten Services u.a. für die Erstellung von Marketingkampagnen.",
          "date": "Januar 2024 - heute"
        },
        "douglas": {
          "company": "Parfümerie Douglas GmbH",
          "title": "Frontend Entwicklerin",
          "description": "Entwicklung von internationalen CRM Produkten u.a. 360° Ansicht auf den Kunden und Kassenfrontends inkl. Kommunikation mit dem Kassensytem (Mobilgerät & Terminal). Moderation von SCRUM Events. Vertretung für den Product Owner.",
          "date": "Mai 2021 - Dezember 2023"
        },
        "tu-dortmund-wimi": {
          "company": "TU Dortmund",
          "title": "Wissenschaftliche Mitarbeiterin",
          "description": "Entwicklung von domänenspezifischen Sprachen (DSLs) inkl. Modeltransformation mit MPS, Weiterentwicklung von bestehenden DSLs mit Fokus auf UI/UX.",
          "date": "August 2020 - April 2021"
        },
        "tu-dortmund": {
          "title": "Studentische/Wissenschaftliche Hilfskraft",
          "description": "Weiterentwicklung von DSLs durch Views, Validierung und nutzerfreundlichem Design.",
          "date": "Juni 2016 - Juli 2020"
        }
      },
      "education": {
        "headline": "Bildung",
        "master": {
          "company": "TU Dortmund",
          "title": "Master of Science in Informatik",
          "description": "LiveDocs: Document-Centric Process Management",
          "date": "April 2018 - Juli 2020"
        },
        "bachelor": {
          "company": "TU Dortmund",
          "title": "Bachelor of Science in Informatik",
          "description": "Graphische Modellierung von Cinco Produktspezifikationen",
          "date": "Oktober 2014 - Mai 2018"
        },
        "university": {
          "date": "Juni 2016 - April 2021"
        }
      },
      "skills": {
        "headline": "Fähigkeiten",
        "language": {
          "title": "Sprachen",
          "german": "Deutsch",
          "english": "Englisch"
        },
        "programming-languages": {
          "title": "Programmiersprachen"
        }
      },
      "knowledge": {
        "headline": "Kenntnisse"
      },
      "projects": {
        "headline": "Projekte",
        "stagedates": {
          "1": "Verantwortlich für die Integration neuer API-Schnittstellen für eine Ticketing-Plattform unter enger Einhaltung vorgegebener Designrichtlinien.",
          "2": "Integration eines Drittsystems (Future Demand) zur Nutzung KI-basierter Services.",
          "3": "Verantwortlich für den Aufbau und die Pflege einer Komponentenbibliothek."
        },
        "cc": {
          "1": "Refactoring der Kundendatenplattform sowie Integration neuer Features.",
          "2": "Erstellung von End-to-End Tests und Mockups."
        },
        "pos": {
          "1": "Refactoring und Entwicklung neuer Features für die stationäre und mobile Kasse, mit besonderem Fokus auf die Kommunikation mit dem Kassensystem.",
          "2": "Hauptverantwortlich für die Umsetzung der mobilen Kasse sowie deren Qualitätssicherung mittels End-to-End Tests."
        },
        "ui": {
          "1": "Weiterentwicklung einer projektübergreifenden Komponentenbibliothek sowie dessen Einsatz im Tagesgeschäft."
        },
        "cinco": {
          "1": "Weiterentwicklung und Erstellung von jUnit-Tests eines generatorgetriebenen Entwicklungsframeworks für domänenspezifische grafische Modellierungswerkzeuge.",
          "2": "Entwicklung grafischer DSLs zur Ablösung textueller DSLs.",
          "3": "Nutzung des Framework, um formularbasierte Prozesse in einer Webapplikation zu modellieren."
        }
      },
      "privateProjects": {
        "headline": "Private Projekte",
        "cv": {
          "description": "Webapplikation die den persönlichen Lebenslauf umfasst. Nutzer können sowohl das Theme als auch die Sprache anpassen. Außerdem kann der Lebenslauf als PDF heruntergeladen werden."
        },
        "cloudy": {
          "description": "Wetter App, deren Fokus besonders auf dem Glassmorphismus Design liegt."
        },
        "tic": {
          "description": "Das Tic Tac Toe-Spiel bietet ein modernes Design, welches zuvor in Figma erstellt wurde."
        },
        "todo": {
          "description": "Diese ToDo-Anwendung wurde zu Übungszwecken entwickelt, um die Grundladen zu vertiefen und mit Theming sowie Drag&Drop zu experimentieren."
        },
        "blog": {
          "description": "Dieser Bridgerton inspirierte Blog dient als Übungsprojekt mit Vue.js."
        }
      }
    }
  }
}
