{
  "title": "CV",
  "grade": "Grade",
  "header": {
    "download": "Download"
  },
  "resume": {
    "header": {
      "name": "Annika Fuhge",
      "title": "Frontend Developer",
      "quote": "I love to be creative, to organize myself, and to work in a team. My personal development is very important to me, therefore, I am eager and willing to learn new skills."

    },
    "content": {
      "work-experience": {
        "headline": "Experience",
        "cgm": {
          "company": "CompuGroup Medical SE & Co. KGaA",
          "title": "Frontend Developer",
          "description": "Further development of the cloud-based dental software “CGM XDENT”.",
          "date": "June 2025 - today"
        },
        "ecostag": {
          "company": "ecostag GmbH",
          "title": "Frontend Developer",
          "description": "Development of a ticketing platform with focus on the promoter area. Collaboration with Future Demand on the integration of their AI-based services e.g. for the creation of marketing campaigns.",
          "date": "January 2024 - May 2025"
        },
        "douglas": {
          "company": "Parfümerie Douglas GmbH",
          "title": "Frontend Developer",
          "description": "Development of international CRM products including 360° view of the customer and POS frontends incl. communication with POS system (mobile device & terminal). Moderation of SCRUM events. Substitution for the product owner.",
          "date": "May 2021 - December 2023"
        },
        "tu-dortmund-wimi": {
          "company": "TU Dortmund",
          "title": "Research Assistant",
          "description": "Development of Domain Specific Languages (DSLs) incl. model transformation with MPS, further development of existing DSLs with focus on UI/UX.",
          "date": "August 2020 - April 2021"
        },
        "tu-dortmund": {
          "company": "TU Dortmund",
          "title": "Student/Scientific Assistant",
          "description": "Further development of DSLs through views, validation, and user-friendly design.",
          "date": "June 2016 - July 2020"
        }
      },
      "education": {
        "headline": "Education",
        "master": {
          "company": "TU Dortmund",
          "title": "Master of Science in Computer Science",
          "description": "LiveDocs: Document-Centric Process Management",
          "date": "October 2014 - July 2020"
        },
        "bachelor": {
          "title": "Bachelor of Science in Computer Science",
          "description": "Graphic modeling of Cinco product specifications",
          "date": "October 2014 - May 2018"
        },
        "university": {
          "date": "June 2016 - April 2021"
        }
      },
      "skills": {
        "headline": "Skills",
        "language": {
          "title": "Languages",
          "german": "German",
          "english": "English"
        },
        "programming-languages": {
          "title": "Programming languages"
        }
      },
      "knowledge": {
        "headline": "Knowledge"
      },
      "projects": {
        "headline": "Projects",
        "cgm": {
          "1": "Fixing bugs within the \"CGM XDENT\" dental software.",
          "2": "Writing unit tests with Jest."
        },
        "stagedates": {
          "1": "Responsible for the integration of new API interfaces for a ticketing platform in close compliance with specified design guidelines.",
          "2": "Integration of a third-party system (Future Demand) for the use of AI-based services.",
          "3": "Responsible for the development and maintenance of a component library."
        },
        "cc": {
          "1": "Refactoring of the customer data platform and integration of new features.",
          "2": "Implementation of end-to-end tests and mockups."
        },
        "pos": {
          "1": "Refactoring and development of new features for the stationary and mobile POS, with a special focus on communication with the POS system.",
          "2": "Mainly responsible for the implementation of the mobile POS and its quality assurance through end-to-end tests."
        },
        "ui": {
          "1": "Development of a cross-project component library and its use in day-to-day business."
        },
        "cinco": {
          "1": "Development and creation of jUnit tests of a generator-driven development framework for domain-specific graphical modelling tools.",
          "2": "Development of graphical DSLs to replace textual DSLs.",
          "3": "Use of the framework to model form-based processes in a web application."
        }
      },
      "privateProjects": {
        "headline": "Private Projects",
        "cv": {
          "description": "Web application that includes the personal CV. Users can customise both the theme and the language. The CV can also be downloaded as a PDF."
        },
        "cloudy": {
          "description": "Weather app with a special focus on the glass morphism design."
        },
        "tic": {
          "description": "The Tic Tac Toe game offers a modern design, which was previously created in Figma."
        },
        "todo": {
          "description": "This ToDo application was developed for practice purposes to deepen the basic and to experiment with theming and drag & drop."
        },
        "blog": {
          "description": "This Bridgerton inspired blog serves as a practice project with Vue.js."
        },
        "bookstoreUI": {
          "description": "Web application with Angular 19 for managing books. Users can choose the theme themselves. (WIP)"
        },
        "bookstoreBackend": {
          "description": "A Spring Boot + Kotlin backend for managing books. (WIP)"
        }
      }
    }
  }
}
